Infineon/mtb-xmclib-cat3/CMSIS/Infineon/COMPONENT_XMC4108/Include/XMC4108.h
/* --------------------------------  HRPWM0_GLBANA  ------------------------------- */
#define HRPWM0_GLBANA_SLDLY_Pos               (0UL)                     /*!< HRPWM0 GLBANA: SLDLY (Bit 0)                                */
#define HRPWM0_GLBANA_SLDLY_Msk               (0x3UL)                   /*!< HRPWM0 GLBANA: SLDLY (Bitfield-Mask: 0x03)                  */
#define HRPWM0_GLBANA_FUP_Pos                 (2UL)                     /*!< HRPWM0 GLBANA: FUP (Bit 2)                                  */
#define HRPWM0_GLBANA_FUP_Msk                 (0x4UL)                   /*!< HRPWM0 GLBANA: FUP (Bitfield-Mask: 0x01)                    */
#define HRPWM0_GLBANA_FDN_Pos                 (3UL)                     /*!< HRPWM0 GLBANA: FDN (Bit 3)                                  */
#define HRPWM0_GLBANA_FDN_Msk                 (0x8UL)                   /*!< HRPWM0 GLBANA: FDN (Bitfield-Mask: 0x01)                    */
#define HRPWM0_GLBANA_SLCP_Pos                (6UL)                     /*!< HRPWM0 GLBANA: SLCP (Bit 6)                                 */
#define HRPWM0_GLBANA_SLCP_Msk                (0x1c0UL)                 /*!< HRPWM0 GLBANA: SLCP (Bitfield-Mask: 0x07)                   */
#define HRPWM0_GLBANA_SLIBLDO_Pos             (9UL)                     /*!< HRPWM0 GLBANA: SLIBLDO (Bit 9)                              */
#define HRPWM0_GLBANA_SLIBLDO_Msk             (0x600UL)                 /*!< HRPWM0 GLBANA: SLIBLDO (Bitfield-Mask: 0x03)                */
#define HRPWM0_GLBANA_SLIBLF_Pos              (11UL)                    /*!< HRPWM0 GLBANA: SLIBLF (Bit 11)                              */
#define HRPWM0_GLBANA_SLIBLF_Msk              (0x1800UL)                /*!< HRPWM0 GLBANA: SLIBLF (Bitfield-Mask: 0x03)                 */
#define HRPWM0_GLBANA_SLVREF_Pos              (13UL)                    /*!< HRPWM0 GLBANA: SLVREF (Bit 13)                              */
#define HRPWM0_GLBANA_SLVREF_Msk              (0xe000UL)                /*!< HRPWM0 GLBANA: SLVREF (Bitfield-Mask: 0x07)                 */
#define HRPWM0_GLBANA_TRIBIAS_Pos             (16UL)                    /*!< HRPWM0 GLBANA: TRIBIAS (Bit 16)                             */
#define HRPWM0_GLBANA_TRIBIAS_Msk             (0x30000UL)               /*!< HRPWM0 GLBANA: TRIBIAS (Bitfield-Mask: 0x03)                */
#define HRPWM0_GLBANA_GHREN_Pos               (18UL)                    /*!< HRPWM0 GLBANA: GHREN (Bit 18)                               */
#define HRPWM0_GLBANA_GHREN_Msk               (0x40000UL)               /*!< HRPWM0 GLBANA: GHREN (Bitfield-Mask: 0x01)                  */

/* --------------------------------  HRPWM0_CSGCFG  ------------------------------- */
#define HRPWM0_CSGCFG_C0PM_Pos                (0UL)                     /*!< HRPWM0 CSGCFG: C0PM (Bit 0)                                 */
#define HRPWM0_CSGCFG_C0PM_Msk                (0x3UL)                   /*!< HRPWM0 CSGCFG: C0PM (Bitfield-Mask: 0x03)                   */
#define HRPWM0_CSGCFG_C1PM_Pos                (2UL)                     /*!< HRPWM0 CSGCFG: C1PM (Bit 2)                                 */
#define HRPWM0_CSGCFG_C1PM_Msk                (0xcUL)                   /*!< HRPWM0 CSGCFG: C1PM (Bitfield-Mask: 0x03)                   */
#define HRPWM0_CSGCFG_C2PM_Pos                (4UL)                     /*!< HRPWM0 CSGCFG: C2PM (Bit 4)                                 */
#define HRPWM0_CSGCFG_C2PM_Msk                (0x30UL)                  /*!< HRPWM0 CSGCFG: C2PM (Bitfield-Mask: 0x03)                   */
#define HRPWM0_CSGCFG_C0CD_Pos                (16UL)                    /*!< HRPWM0 CSGCFG: C0CD (Bit 16)                                */
#define HRPWM0_CSGCFG_C0CD_Msk                (0x10000UL)               /*!< HRPWM0 CSGCFG: C0CD (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSGCFG_C1CD_Pos                (17UL)                    /*!< HRPWM0 CSGCFG: C1CD (Bit 17)                                */
#define HRPWM0_CSGCFG_C1CD_Msk                (0x20000UL)               /*!< HRPWM0 CSGCFG: C1CD (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSGCFG_C2CD_Pos                (18UL)                    /*!< HRPWM0 CSGCFG: C2CD (Bit 18)                                */
#define HRPWM0_CSGCFG_C2CD_Msk                (0x40000UL)               /*!< HRPWM0 CSGCFG: C2CD (Bitfield-Mask: 0x01)                   */

/* -------------------------------  HRPWM0_CSGSETG  ------------------------------- */
#define HRPWM0_CSGSETG_SD0R_Pos               (0UL)                     /*!< HRPWM0 CSGSETG: SD0R (Bit 0)                                */
#define HRPWM0_CSGSETG_SD0R_Msk               (0x1UL)                   /*!< HRPWM0 CSGSETG: SD0R (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGSETG_SC0R_Pos               (1UL)                     /*!< HRPWM0 CSGSETG: SC0R (Bit 1)                                */
#define HRPWM0_CSGSETG_SC0R_Msk               (0x2UL)                   /*!< HRPWM0 CSGSETG: SC0R (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGSETG_SC0P_Pos               (2UL)                     /*!< HRPWM0 CSGSETG: SC0P (Bit 2)                                */
#define HRPWM0_CSGSETG_SC0P_Msk               (0x4UL)                   /*!< HRPWM0 CSGSETG: SC0P (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGSETG_SD1R_Pos               (4UL)                     /*!< HRPWM0 CSGSETG: SD1R (Bit 4)                                */
#define HRPWM0_CSGSETG_SD1R_Msk               (0x10UL)                  /*!< HRPWM0 CSGSETG: SD1R (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGSETG_SC1R_Pos               (5UL)                     /*!< HRPWM0 CSGSETG: SC1R (Bit 5)                                */
#define HRPWM0_CSGSETG_SC1R_Msk               (0x20UL)                  /*!< HRPWM0 CSGSETG: SC1R (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGSETG_SC1P_Pos               (6UL)                     /*!< HRPWM0 CSGSETG: SC1P (Bit 6)                                */
#define HRPWM0_CSGSETG_SC1P_Msk               (0x40UL)                  /*!< HRPWM0 CSGSETG: SC1P (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGSETG_SD2R_Pos               (8UL)                     /*!< HRPWM0 CSGSETG: SD2R (Bit 8)                                */
#define HRPWM0_CSGSETG_SD2R_Msk               (0x100UL)                 /*!< HRPWM0 CSGSETG: SD2R (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGSETG_SC2R_Pos               (9UL)                     /*!< HRPWM0 CSGSETG: SC2R (Bit 9)                                */
#define HRPWM0_CSGSETG_SC2R_Msk               (0x200UL)                 /*!< HRPWM0 CSGSETG: SC2R (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGSETG_SC2P_Pos               (10UL)                    /*!< HRPWM0 CSGSETG: SC2P (Bit 10)                               */
#define HRPWM0_CSGSETG_SC2P_Msk               (0x400UL)                 /*!< HRPWM0 CSGSETG: SC2P (Bitfield-Mask: 0x01)                  */

/* -------------------------------  HRPWM0_CSGCLRG  ------------------------------- */
#define HRPWM0_CSGCLRG_CD0R_Pos               (0UL)                     /*!< HRPWM0 CSGCLRG: CD0R (Bit 0)                                */
#define HRPWM0_CSGCLRG_CD0R_Msk               (0x1UL)                   /*!< HRPWM0 CSGCLRG: CD0R (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGCLRG_CC0R_Pos               (1UL)                     /*!< HRPWM0 CSGCLRG: CC0R (Bit 1)                                */
#define HRPWM0_CSGCLRG_CC0R_Msk               (0x2UL)                   /*!< HRPWM0 CSGCLRG: CC0R (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGCLRG_CC0P_Pos               (2UL)                     /*!< HRPWM0 CSGCLRG: CC0P (Bit 2)                                */
#define HRPWM0_CSGCLRG_CC0P_Msk               (0x4UL)                   /*!< HRPWM0 CSGCLRG: CC0P (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGCLRG_CD1R_Pos               (4UL)                     /*!< HRPWM0 CSGCLRG: CD1R (Bit 4)                                */
#define HRPWM0_CSGCLRG_CD1R_Msk               (0x10UL)                  /*!< HRPWM0 CSGCLRG: CD1R (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGCLRG_CC1R_Pos               (5UL)                     /*!< HRPWM0 CSGCLRG: CC1R (Bit 5)                                */
#define HRPWM0_CSGCLRG_CC1R_Msk               (0x20UL)                  /*!< HRPWM0 CSGCLRG: CC1R (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGCLRG_CC1P_Pos               (6UL)                     /*!< HRPWM0 CSGCLRG: CC1P (Bit 6)                                */
#define HRPWM0_CSGCLRG_CC1P_Msk               (0x40UL)                  /*!< HRPWM0 CSGCLRG: CC1P (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGCLRG_CD2R_Pos               (8UL)                     /*!< HRPWM0 CSGCLRG: CD2R (Bit 8)                                */
#define HRPWM0_CSGCLRG_CD2R_Msk               (0x100UL)                 /*!< HRPWM0 CSGCLRG: CD2R (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGCLRG_CC2R_Pos               (9UL)                     /*!< HRPWM0 CSGCLRG: CC2R (Bit 9)                                */
#define HRPWM0_CSGCLRG_CC2R_Msk               (0x200UL)                 /*!< HRPWM0 CSGCLRG: CC2R (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGCLRG_CC2P_Pos               (10UL)                    /*!< HRPWM0 CSGCLRG: CC2P (Bit 10)                               */
#define HRPWM0_CSGCLRG_CC2P_Msk               (0x400UL)                 /*!< HRPWM0 CSGCLRG: CC2P (Bitfield-Mask: 0x01)                  */

/* -------------------------------  HRPWM0_CSGSTATG  ------------------------------ */
#define HRPWM0_CSGSTATG_D0RB_Pos              (0UL)                     /*!< HRPWM0 CSGSTATG: D0RB (Bit 0)                               */
#define HRPWM0_CSGSTATG_D0RB_Msk              (0x1UL)                   /*!< HRPWM0 CSGSTATG: D0RB (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSGSTATG_C0RB_Pos              (1UL)                     /*!< HRPWM0 CSGSTATG: C0RB (Bit 1)                               */
#define HRPWM0_CSGSTATG_C0RB_Msk              (0x2UL)                   /*!< HRPWM0 CSGSTATG: C0RB (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSGSTATG_PSLS0_Pos             (2UL)                     /*!< HRPWM0 CSGSTATG: PSLS0 (Bit 2)                              */
#define HRPWM0_CSGSTATG_PSLS0_Msk             (0x4UL)                   /*!< HRPWM0 CSGSTATG: PSLS0 (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSGSTATG_D1RB_Pos              (4UL)                     /*!< HRPWM0 CSGSTATG: D1RB (Bit 4)                               */
#define HRPWM0_CSGSTATG_D1RB_Msk              (0x10UL)                  /*!< HRPWM0 CSGSTATG: D1RB (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSGSTATG_C1RB_Pos              (5UL)                     /*!< HRPWM0 CSGSTATG: C1RB (Bit 5)                               */
#define HRPWM0_CSGSTATG_C1RB_Msk              (0x20UL)                  /*!< HRPWM0 CSGSTATG: C1RB (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSGSTATG_PSLS1_Pos             (6UL)                     /*!< HRPWM0 CSGSTATG: PSLS1 (Bit 6)                              */
#define HRPWM0_CSGSTATG_PSLS1_Msk             (0x40UL)                  /*!< HRPWM0 CSGSTATG: PSLS1 (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSGSTATG_D2RB_Pos              (8UL)                     /*!< HRPWM0 CSGSTATG: D2RB (Bit 8)                               */
#define HRPWM0_CSGSTATG_D2RB_Msk              (0x100UL)                 /*!< HRPWM0 CSGSTATG: D2RB (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSGSTATG_C2RB_Pos              (9UL)                     /*!< HRPWM0 CSGSTATG: C2RB (Bit 9)                               */
#define HRPWM0_CSGSTATG_C2RB_Msk              (0x200UL)                 /*!< HRPWM0 CSGSTATG: C2RB (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSGSTATG_PSLS2_Pos             (10UL)                    /*!< HRPWM0 CSGSTATG: PSLS2 (Bit 10)                             */
#define HRPWM0_CSGSTATG_PSLS2_Msk             (0x400UL)                 /*!< HRPWM0 CSGSTATG: PSLS2 (Bitfield-Mask: 0x01)                */

/* --------------------------------  HRPWM0_CSGFCG  ------------------------------- */
#define HRPWM0_CSGFCG_S0STR_Pos               (0UL)                     /*!< HRPWM0 CSGFCG: S0STR (Bit 0)                                */
#define HRPWM0_CSGFCG_S0STR_Msk               (0x1UL)                   /*!< HRPWM0 CSGFCG: S0STR (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGFCG_S0STP_Pos               (1UL)                     /*!< HRPWM0 CSGFCG: S0STP (Bit 1)                                */
#define HRPWM0_CSGFCG_S0STP_Msk               (0x2UL)                   /*!< HRPWM0 CSGFCG: S0STP (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGFCG_PS0STR_Pos              (2UL)                     /*!< HRPWM0 CSGFCG: PS0STR (Bit 2)                               */
#define HRPWM0_CSGFCG_PS0STR_Msk              (0x4UL)                   /*!< HRPWM0 CSGFCG: PS0STR (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSGFCG_PS0STP_Pos              (3UL)                     /*!< HRPWM0 CSGFCG: PS0STP (Bit 3)                               */
#define HRPWM0_CSGFCG_PS0STP_Msk              (0x8UL)                   /*!< HRPWM0 CSGFCG: PS0STP (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSGFCG_PS0CLR_Pos              (4UL)                     /*!< HRPWM0 CSGFCG: PS0CLR (Bit 4)                               */
#define HRPWM0_CSGFCG_PS0CLR_Msk              (0x10UL)                  /*!< HRPWM0 CSGFCG: PS0CLR (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSGFCG_S1STR_Pos               (8UL)                     /*!< HRPWM0 CSGFCG: S1STR (Bit 8)                                */
#define HRPWM0_CSGFCG_S1STR_Msk               (0x100UL)                 /*!< HRPWM0 CSGFCG: S1STR (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGFCG_S1STP_Pos               (9UL)                     /*!< HRPWM0 CSGFCG: S1STP (Bit 9)                                */
#define HRPWM0_CSGFCG_S1STP_Msk               (0x200UL)                 /*!< HRPWM0 CSGFCG: S1STP (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGFCG_PS1STR_Pos              (10UL)                    /*!< HRPWM0 CSGFCG: PS1STR (Bit 10)                              */
#define HRPWM0_CSGFCG_PS1STR_Msk              (0x400UL)                 /*!< HRPWM0 CSGFCG: PS1STR (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSGFCG_PS1STP_Pos              (11UL)                    /*!< HRPWM0 CSGFCG: PS1STP (Bit 11)                              */
#define HRPWM0_CSGFCG_PS1STP_Msk              (0x800UL)                 /*!< HRPWM0 CSGFCG: PS1STP (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSGFCG_PS1CLR_Pos              (12UL)                    /*!< HRPWM0 CSGFCG: PS1CLR (Bit 12)                              */
#define HRPWM0_CSGFCG_PS1CLR_Msk              (0x1000UL)                /*!< HRPWM0 CSGFCG: PS1CLR (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSGFCG_S2STR_Pos               (16UL)                    /*!< HRPWM0 CSGFCG: S2STR (Bit 16)                               */
#define HRPWM0_CSGFCG_S2STR_Msk               (0x10000UL)               /*!< HRPWM0 CSGFCG: S2STR (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGFCG_S2STP_Pos               (17UL)                    /*!< HRPWM0 CSGFCG: S2STP (Bit 17)                               */
#define HRPWM0_CSGFCG_S2STP_Msk               (0x20000UL)               /*!< HRPWM0 CSGFCG: S2STP (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGFCG_PS2STR_Pos              (18UL)                    /*!< HRPWM0 CSGFCG: PS2STR (Bit 18)                              */
#define HRPWM0_CSGFCG_PS2STR_Msk              (0x40000UL)               /*!< HRPWM0 CSGFCG: PS2STR (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSGFCG_PS2STP_Pos              (19UL)                    /*!< HRPWM0 CSGFCG: PS2STP (Bit 19)                              */
#define HRPWM0_CSGFCG_PS2STP_Msk              (0x80000UL)               /*!< HRPWM0 CSGFCG: PS2STP (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSGFCG_PS2CLR_Pos              (20UL)                    /*!< HRPWM0 CSGFCG: PS2CLR (Bit 20)                              */
#define HRPWM0_CSGFCG_PS2CLR_Msk              (0x100000UL)              /*!< HRPWM0 CSGFCG: PS2CLR (Bitfield-Mask: 0x01)                 */

/* --------------------------------  HRPWM0_CSGFSG  ------------------------------- */
#define HRPWM0_CSGFSG_S0RB_Pos                (0UL)                     /*!< HRPWM0 CSGFSG: S0RB (Bit 0)                                 */
#define HRPWM0_CSGFSG_S0RB_Msk                (0x1UL)                   /*!< HRPWM0 CSGFSG: S0RB (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSGFSG_P0RB_Pos                (1UL)                     /*!< HRPWM0 CSGFSG: P0RB (Bit 1)                                 */
#define HRPWM0_CSGFSG_P0RB_Msk                (0x2UL)                   /*!< HRPWM0 CSGFSG: P0RB (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSGFSG_S1RB_Pos                (8UL)                     /*!< HRPWM0 CSGFSG: S1RB (Bit 8)                                 */
#define HRPWM0_CSGFSG_S1RB_Msk                (0x100UL)                 /*!< HRPWM0 CSGFSG: S1RB (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSGFSG_P1RB_Pos                (9UL)                     /*!< HRPWM0 CSGFSG: P1RB (Bit 9)                                 */
#define HRPWM0_CSGFSG_P1RB_Msk                (0x200UL)                 /*!< HRPWM0 CSGFSG: P1RB (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSGFSG_S2RB_Pos                (16UL)                    /*!< HRPWM0 CSGFSG: S2RB (Bit 16)                                */
#define HRPWM0_CSGFSG_S2RB_Msk                (0x10000UL)               /*!< HRPWM0 CSGFSG: S2RB (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSGFSG_P2RB_Pos                (17UL)                    /*!< HRPWM0 CSGFSG: P2RB (Bit 17)                                */
#define HRPWM0_CSGFSG_P2RB_Msk                (0x20000UL)               /*!< HRPWM0 CSGFSG: P2RB (Bitfield-Mask: 0x01)                   */

/* --------------------------------  HRPWM0_CSGTRG  ------------------------------- */
#define HRPWM0_CSGTRG_D0SES_Pos               (0UL)                     /*!< HRPWM0 CSGTRG: D0SES (Bit 0)                                */
#define HRPWM0_CSGTRG_D0SES_Msk               (0x1UL)                   /*!< HRPWM0 CSGTRG: D0SES (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGTRG_D0SVS_Pos               (1UL)                     /*!< HRPWM0 CSGTRG: D0SVS (Bit 1)                                */
#define HRPWM0_CSGTRG_D0SVS_Msk               (0x2UL)                   /*!< HRPWM0 CSGTRG: D0SVS (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGTRG_D1SES_Pos               (4UL)                     /*!< HRPWM0 CSGTRG: D1SES (Bit 4)                                */
#define HRPWM0_CSGTRG_D1SES_Msk               (0x10UL)                  /*!< HRPWM0 CSGTRG: D1SES (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGTRG_D1SVS_Pos               (5UL)                     /*!< HRPWM0 CSGTRG: D1SVS (Bit 5)                                */
#define HRPWM0_CSGTRG_D1SVS_Msk               (0x20UL)                  /*!< HRPWM0 CSGTRG: D1SVS (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGTRG_D2SES_Pos               (8UL)                     /*!< HRPWM0 CSGTRG: D2SES (Bit 8)                                */
#define HRPWM0_CSGTRG_D2SES_Msk               (0x100UL)                 /*!< HRPWM0 CSGTRG: D2SES (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGTRG_D2SVS_Pos               (9UL)                     /*!< HRPWM0 CSGTRG: D2SVS (Bit 9)                                */
#define HRPWM0_CSGTRG_D2SVS_Msk               (0x200UL)                 /*!< HRPWM0 CSGTRG: D2SVS (Bitfield-Mask: 0x01)                  */

/* --------------------------------  HRPWM0_CSGTRC  ------------------------------- */
#define HRPWM0_CSGTRC_D0SEC_Pos               (0UL)                     /*!< HRPWM0 CSGTRC: D0SEC (Bit 0)                                */
#define HRPWM0_CSGTRC_D0SEC_Msk               (0x1UL)                   /*!< HRPWM0 CSGTRC: D0SEC (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGTRC_D1SEC_Pos               (4UL)                     /*!< HRPWM0 CSGTRC: D1SEC (Bit 4)                                */
#define HRPWM0_CSGTRC_D1SEC_Msk               (0x10UL)                  /*!< HRPWM0 CSGTRC: D1SEC (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSGTRC_D2SEC_Pos               (8UL)                     /*!< HRPWM0 CSGTRC: D2SEC (Bit 8)                                */
#define HRPWM0_CSGTRC_D2SEC_Msk               (0x100UL)                 /*!< HRPWM0 CSGTRC: D2SEC (Bitfield-Mask: 0x01)                  */

/* -------------------------------  HRPWM0_CSGTRSG  ------------------------------- */
#define HRPWM0_CSGTRSG_D0STE_Pos              (0UL)                     /*!< HRPWM0 CSGTRSG: D0STE (Bit 0)                               */
#define HRPWM0_CSGTRSG_D0STE_Msk              (0x1UL)                   /*!< HRPWM0 CSGTRSG: D0STE (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSGTRSG_SW0ST_Pos              (1UL)                     /*!< HRPWM0 CSGTRSG: SW0ST (Bit 1)                               */
#define HRPWM0_CSGTRSG_SW0ST_Msk              (0x2UL)                   /*!< HRPWM0 CSGTRSG: SW0ST (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSGTRSG_D1STE_Pos              (4UL)                     /*!< HRPWM0 CSGTRSG: D1STE (Bit 4)                               */
#define HRPWM0_CSGTRSG_D1STE_Msk              (0x10UL)                  /*!< HRPWM0 CSGTRSG: D1STE (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSGTRSG_SW1ST_Pos              (5UL)                     /*!< HRPWM0 CSGTRSG: SW1ST (Bit 5)                               */
#define HRPWM0_CSGTRSG_SW1ST_Msk              (0x20UL)                  /*!< HRPWM0 CSGTRSG: SW1ST (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSGTRSG_D2STE_Pos              (8UL)                     /*!< HRPWM0 CSGTRSG: D2STE (Bit 8)                               */
#define HRPWM0_CSGTRSG_D2STE_Msk              (0x100UL)                 /*!< HRPWM0 CSGTRSG: D2STE (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSGTRSG_SW2ST_Pos              (9UL)                     /*!< HRPWM0 CSGTRSG: SW2ST (Bit 9)                               */
#define HRPWM0_CSGTRSG_SW2ST_Msk              (0x200UL)                 /*!< HRPWM0 CSGTRSG: SW2ST (Bitfield-Mask: 0x01)                 */

