Infineon/mtb-xmclib-cat3/CMSIS/Infineon/COMPONENT_XMC4108/Include/XMC4108.h
/* -------------------------------  HRPWM0_CSG_SRS  ------------------------------- */
#define HRPWM0_CSG_SRS_VLS1S_Pos              (0UL)                     /*!< HRPWM0_CSG SRS: VLS1S (Bit 0)                               */
#define HRPWM0_CSG_SRS_VLS1S_Msk              (0x3UL)                   /*!< HRPWM0_CSG SRS: VLS1S (Bitfield-Mask: 0x03)                 */
#define HRPWM0_CSG_SRS_VLS2S_Pos              (2UL)                     /*!< HRPWM0_CSG SRS: VLS2S (Bit 2)                               */
#define HRPWM0_CSG_SRS_VLS2S_Msk              (0xcUL)                   /*!< HRPWM0_CSG SRS: VLS2S (Bitfield-Mask: 0x03)                 */
#define HRPWM0_CSG_SRS_TRLS_Pos               (4UL)                     /*!< HRPWM0_CSG SRS: TRLS (Bit 4)                                */
#define HRPWM0_CSG_SRS_TRLS_Msk               (0x30UL)                  /*!< HRPWM0_CSG SRS: TRLS (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG_SRS_SSLS_Pos               (6UL)                     /*!< HRPWM0_CSG SRS: SSLS (Bit 6)                                */
#define HRPWM0_CSG_SRS_SSLS_Msk               (0xc0UL)                  /*!< HRPWM0_CSG SRS: SSLS (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG_SRS_STLS_Pos               (8UL)                     /*!< HRPWM0_CSG SRS: STLS (Bit 8)                                */
#define HRPWM0_CSG_SRS_STLS_Msk               (0x300UL)                 /*!< HRPWM0_CSG SRS: STLS (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG_SRS_CRFLS_Pos              (10UL)                    /*!< HRPWM0_CSG SRS: CRFLS (Bit 10)                              */
#define HRPWM0_CSG_SRS_CRFLS_Msk              (0xc00UL)                 /*!< HRPWM0_CSG SRS: CRFLS (Bitfield-Mask: 0x03)                 */
#define HRPWM0_CSG_SRS_CSLS_Pos               (12UL)                    /*!< HRPWM0_CSG SRS: CSLS (Bit 12)                               */
#define HRPWM0_CSG_SRS_CSLS_Msk               (0x3000UL)                /*!< HRPWM0_CSG SRS: CSLS (Bitfield-Mask: 0x03)                  */

/* -------------------------------  HRPWM0_CSG_SWS  ------------------------------- */
#define HRPWM0_CSG_SWS_SVLS1_Pos              (0UL)                     /*!< HRPWM0_CSG SWS: SVLS1 (Bit 0)                               */
#define HRPWM0_CSG_SWS_SVLS1_Msk              (0x1UL)                   /*!< HRPWM0_CSG SWS: SVLS1 (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG_SWS_SVLS2_Pos              (1UL)                     /*!< HRPWM0_CSG SWS: SVLS2 (Bit 1)                               */
#define HRPWM0_CSG_SWS_SVLS2_Msk              (0x2UL)                   /*!< HRPWM0_CSG SWS: SVLS2 (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG_SWS_STRGS_Pos              (2UL)                     /*!< HRPWM0_CSG SWS: STRGS (Bit 2)                               */
#define HRPWM0_CSG_SWS_STRGS_Msk              (0x4UL)                   /*!< HRPWM0_CSG SWS: STRGS (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG_SWS_SSTRS_Pos              (3UL)                     /*!< HRPWM0_CSG SWS: SSTRS (Bit 3)                               */
#define HRPWM0_CSG_SWS_SSTRS_Msk              (0x8UL)                   /*!< HRPWM0_CSG SWS: SSTRS (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG_SWS_SSTPS_Pos              (4UL)                     /*!< HRPWM0_CSG SWS: SSTPS (Bit 4)                               */
#define HRPWM0_CSG_SWS_SSTPS_Msk              (0x10UL)                  /*!< HRPWM0_CSG SWS: SSTPS (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG_SWS_SSTD_Pos               (5UL)                     /*!< HRPWM0_CSG SWS: SSTD (Bit 5)                                */
#define HRPWM0_CSG_SWS_SSTD_Msk               (0x20UL)                  /*!< HRPWM0_CSG SWS: SSTD (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSG_SWS_SCRS_Pos               (6UL)                     /*!< HRPWM0_CSG SWS: SCRS (Bit 6)                                */
#define HRPWM0_CSG_SWS_SCRS_Msk               (0x40UL)                  /*!< HRPWM0_CSG SWS: SCRS (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSG_SWS_SCFS_Pos               (7UL)                     /*!< HRPWM0_CSG SWS: SCFS (Bit 7)                                */
#define HRPWM0_CSG_SWS_SCFS_Msk               (0x80UL)                  /*!< HRPWM0_CSG SWS: SCFS (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSG_SWS_SCSS_Pos               (8UL)                     /*!< HRPWM0_CSG SWS: SCSS (Bit 8)                                */
#define HRPWM0_CSG_SWS_SCSS_Msk               (0x100UL)                 /*!< HRPWM0_CSG SWS: SCSS (Bitfield-Mask: 0x01)                  */

/* -------------------------------  HRPWM0_CSG_SWC  ------------------------------- */
#define HRPWM0_CSG_SWC_CVLS1_Pos              (0UL)                     /*!< HRPWM0_CSG SWC: CVLS1 (Bit 0)                               */
#define HRPWM0_CSG_SWC_CVLS1_Msk              (0x1UL)                   /*!< HRPWM0_CSG SWC: CVLS1 (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG_SWC_CVLS2_Pos              (1UL)                     /*!< HRPWM0_CSG SWC: CVLS2 (Bit 1)                               */
#define HRPWM0_CSG_SWC_CVLS2_Msk              (0x2UL)                   /*!< HRPWM0_CSG SWC: CVLS2 (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG_SWC_CTRGS_Pos              (2UL)                     /*!< HRPWM0_CSG SWC: CTRGS (Bit 2)                               */
#define HRPWM0_CSG_SWC_CTRGS_Msk              (0x4UL)                   /*!< HRPWM0_CSG SWC: CTRGS (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG_SWC_CSTRS_Pos              (3UL)                     /*!< HRPWM0_CSG SWC: CSTRS (Bit 3)                               */
#define HRPWM0_CSG_SWC_CSTRS_Msk              (0x8UL)                   /*!< HRPWM0_CSG SWC: CSTRS (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG_SWC_CSTPS_Pos              (4UL)                     /*!< HRPWM0_CSG SWC: CSTPS (Bit 4)                               */
#define HRPWM0_CSG_SWC_CSTPS_Msk              (0x10UL)                  /*!< HRPWM0_CSG SWC: CSTPS (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG_SWC_CSTD_Pos               (5UL)                     /*!< HRPWM0_CSG SWC: CSTD (Bit 5)                                */
#define HRPWM0_CSG_SWC_CSTD_Msk               (0x20UL)                  /*!< HRPWM0_CSG SWC: CSTD (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSG_SWC_CCRS_Pos               (6UL)                     /*!< HRPWM0_CSG SWC: CCRS (Bit 6)                                */
#define HRPWM0_CSG_SWC_CCRS_Msk               (0x40UL)                  /*!< HRPWM0_CSG SWC: CCRS (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSG_SWC_CCFS_Pos               (7UL)                     /*!< HRPWM0_CSG SWC: CCFS (Bit 7)                                */
#define HRPWM0_CSG_SWC_CCFS_Msk               (0x80UL)                  /*!< HRPWM0_CSG SWC: CCFS (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSG_SWC_CCSS_Pos               (8UL)                     /*!< HRPWM0_CSG SWC: CCSS (Bit 8)                                */
#define HRPWM0_CSG_SWC_CCSS_Msk               (0x100UL)                 /*!< HRPWM0_CSG SWC: CCSS (Bitfield-Mask: 0x01)                  */

